# Interview Questions about DataFrame

## Create a new DataFrame

In [1]:
import pandas as pd

In [3]:
data = [['John', 50, 'Austin', 70],
        ['Cataline', 45 , 'San Francisco', 80],
        ['Matt', 30, 'Boston' , 95]]
columns = ['Name', 'Age', 'City', 'Marks']
df = pd.DataFrame(data, columns=columns)

In [4]:
df

       Name  Age           City  Marks
0      John   50         Austin     70
1  Cataline   45  San Francisco     80
2      Matt   30         Boston     95

In [5]:
data = {'Name':['John', 'Cataline', 'Matt'], 'Age':[50, 45,30], 
        'City':['Austin', 'San Francisco', 'Boston'], 'Marks':[70, 80, 95]}
df_new = pd.DataFrame(data)

In [6]:
df_new

       Name  Age           City  Marks
0      John   50         Austin     70
1  Cataline   45  San Francisco     80
2      Matt   30         Boston     95

##